emacsKnowledge/orgStudy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>org-mode</title>
<!-- 2014-11-29 六 18:18 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="beyondkoma" />
<meta  name="keywords" content="EMACS" />
</head>
<body>
<div id="content">
<h1 class="title">org-mode</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. sdf&#xa0;&#xa0;&#xa0;<span class="tag"><span class="___">大酒神</span></span></a>
<ul>
<li><a href="#sec-1-1">1.1. sfsa&#xa0;&#xa0;&#xa0;<span class="tag"><span class="JINGHUA">JINGHUA</span></span></a></li>
<li><a href="#sec-1-2">1.2. dfkdl</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. sa</a>
<ul>
<li><a href="#sec-1-2-1-1">1.2.1.1. af&#xa0;&#xa0;&#xa0;<span class="tag"><span class="d">d</span></span></a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> sdf&#xa0;&#xa0;&#xa0;<span class="tag"><span class="___">大酒神</span></span></h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> sfsa&#xa0;&#xa0;&#xa0;<span class="tag"><span class="JINGHUA">JINGHUA</span></span></h3>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> dfkdl</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> sa</h4>
<div class="outline-text-4" id="text-1-2-1">
</div><div id="outline-container-sec-1-2-1-1" class="outline-5">
<h5 id="sec-1-2-1-1"><span class="section-number-5">1.2.1.1</span> af&#xa0;&#xa0;&#xa0;<span class="tag"><span class="d">d</span></span></h5>
<div class="outline-text-5" id="text-1-2-1-1">
</div><ol class="org-ol"><li>df&#xa0;&#xa0;&#xa0;<span class="tag"><span class="d">d</span></span><br  /><div class="outline-text-7" id="text-1-2-1-1-0-1">
<p>
asdfshuaige
</p>

<p>
sadfasdllhehehe
</p>

<p>
<a href="http://www.astro.uva.nl/~dominik">http://www.astro.uva.nl/~dominik</a>   
<a href="file:///home/beyonkoma/work/heh.txt">file:///home/beyonkoma/work/heh.txt</a>
</p>

<p>
<i>des</i>
<i>heh</i>
 link
</p>

<p>
锚点 #<a id="my-anchor" name="my-anchor"></a>
[[my-anchor][neib]
</p>


<p>
<b>粗体</b>
<i>斜体</i>
<del>删除线</del>
<span class="underline">下划线</span>
下标: H<sub>2</sub> O
上标: E=mc<sup>2</sup>
等宽字: <code>git</code>  or  <code>git</code>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Name</th>
<th scope="col" class="left">pone</th>
<th scope="col" class="left">age</th>     C-c RET
</tr>
</thead>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
段落
</p>

<p>
My favorite scenes are (in this order)
</p>
<ol class="org-ol">
<li>The attack of the Rohirrim
</li>
<li>Eowyn's fight with the witch king
<ul class="org-ul">
<li>this was already my favorite scene in the book
</li>
<li>I really like Miranda Otto.
</li>
</ul>
</li>
</ol>
<p>
Important actors in this film are:
</p>
<ol class="org-ol">
<li>Elijah Wood :: He plays Frodo
</li>
<li>Sean Austin :: He plays Sam, Frodo's friend.
</li>
</ol>


<ol class="org-ol">
<li>hh :: dd
</li>
<li></li>
<li>
</li>

<li></li>
<li></li>
<li></li>
<li></li>
</ol>


<ul class="org-ul">
<li></li>
</ul>



<p>
<span class="underline"><span class="underline">_</span></span>
</p>
<hr  />



<div class="cnblogs_Highlighter">
<pre class="brush:cpp">
int main()
{
  return 0;
}
</pre>
</div>



<p class="verse">
Great clouds overhead<br  />
Tiny black birds rise and fall<br  />
<br  />
Snow covers Emacs<br  />
&#xa0;&#xa0;&#xa0;&#xa0;&#x2013; AlexSchroeder<br  />
</p>

<blockquote>
<p>
缩进区块
</p>
</blockquote>

<div class="center">
<p>
Everything should be made as simple as possible, <br  />
but not any simpler
</p>
</div>


<pre class="example">
单行的例子以冒号开头
</pre>

<pre class="example">
 多行的例子
 使用区块
</pre>
</div>
</li></ol>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: beyondkoma</p>
<p class="date">Created: 2014-11-29 六 18:18</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.1)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
